backend/app/validators/users/search_validator.rb

    def call
      if @params[:project_id].blank? && !Current.user.admin?
        return failure(:forbidden, error: "Forbidden")
      end

      if @params[:project_id].present?
        project = Project.find_by(id: @params[:project_id])
        return failure(:not_found, error: "Project not found") unless project

        unless Current.user.admin? || Current.user.projects.exists?(id: project.id)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 1 LIMIT 1
SELECT 1 AS one FROM "projects" INNER JOIN "project_users" ON "projects"."id" = "project_users"."project_id" WHERE "project_users"."user_id" = 12 AND "projects"."id" = 2 LIMIT 1