backend/app/services/tickets/board_query_service.rb

    def build_relation
      project_id = @params[:project_id].presence&.to_i
      if project_id.blank? || project_id <= 0
        return failure(:unprocessable_entity, error: "project_id is required")
      end

      unless Project.exists?(id: project_id)
        return failure(:not_found, error: "Project not found")
      end

      unless @current_user.admin? || @current_user.projects.exists?(id: project_id)
---
SELECT "projects".* FROM "projects" INNER JOIN "project_users" ON "projects"."id" = "project_users"."project_id" WHERE "project_users"."user_id" = 8
SELECT 1 AS one FROM "projects" INNER JOIN "project_users" ON "projects"."id" = "project_users"."project_id" WHERE "project_users"."user_id" = 3 AND "projects"."id" = 1 LIMIT 1

      scope = Ticket.includes(:assignee).where(project_id: project_id)

      case (@params[:board_view].presence || "sprint").to_s
      when "sprint"
        sprint_id = @params[:sprint_id].presence&.to_i
        if sprint_id.blank? || sprint_id <= 0
          return failure(:unprocessable_entity, error: "sprint_id is required for sprint board_view")
        end
        unless Sprint.exists?(id: sprint_id, project_id: project_id)
---
SELECT "sprints".* FROM "sprints"
SELECT 1 AS one FROM "sprints" WHERE "sprints"."id" = 1 AND "sprints"."project_id" = 1 LIMIT 1

      scope = scope.where(status: statuses) if statuses.any?

      assignee_ids = integer_list_param(@params[:assignee_ids])
      if assignee_ids.any?
        allowed = Project.find(project_id).user_ids
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 1 LIMIT 1
SELECT "users"."id" FROM "users" INNER JOIN "project_users" ON "users"."id" = "project_users"."user_id" WHERE "project_users"."project_id" = 1

    def board_stats_filters_key
      prio = enum_tokens_param(@params[:priorities], Ticket.priorities.keys).sort.join(",")
      stat = enum_tokens_param(@params[:statuses], Ticket.statuses.keys).sort.join(",")
      assigns = integer_list_param(@params[:assignee_ids]).sort.join(",")
      [
        (@params[:board_view].presence || "sprint"),
        @params[:sprint_id].to_s,
        @params[:q].to_s.downcase.strip,
        prio,
        stat,
        assigns,
        @params[:date_from].to_s,
        @params[:date_to].to_s,
        @current_user.id
      ].join("|")
---
SELECT "sprints".* FROM "sprints"