backend/app/services/tickets/board_query_service.rb

      scope = scope.where(status: statuses) if statuses.any?

      assignee_ids = integer_list_param(@params[:assignee_ids])
      if assignee_ids.any?
        allowed = Project.find(project_id).user_ids
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 1 LIMIT 1
SELECT "users"."id" FROM "users" INNER JOIN "project_users" ON "users"."id" = "project_users"."user_id" WHERE "project_users"."project_id" = 1

    def board_stats_filters_key
      prio = enum_tokens_param(@params[:priorities], Ticket.priorities.keys).sort.join(",")
      stat = enum_tokens_param(@params[:statuses], Ticket.statuses.keys).sort.join(",")
      assigns = integer_list_param(@params[:assignee_ids]).sort.join(",")
      [
        (@params[:board_view].presence || "sprint"),
        @params[:sprint_id].to_s,
        @params[:q].to_s.downcase.strip,
        prio,
        stat,
        assigns,
        @params[:date_from].to_s,
        @params[:date_to].to_s,
        Current.user.id
      ].join("|")
---
SELECT "sprints".* FROM "sprints"
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1