backend/app/services/tickets/create_service.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = 1 LIMIT 1
SELECT 1 AS one FROM "projects" INNER JOIN "project_users" ON "projects"."id" = "project_users"."project_id" WHERE "project_users"."user_id" = 3 AND "projects"."id" = 1 LIMIT 1
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 6 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
SELECT 1 AS one FROM "users" INNER JOIN "project_users" ON "users"."id" = "project_users"."user_id" WHERE "project_users"."project_id" = 1 AND "users"."id" = 2 LIMIT 1
SELECT "sprints".* FROM "sprints" WHERE "sprints"."id" = 1 LIMIT 1
---
    def call
      attrs = @params.permit(
        :title,
        :description,
        :status,
        :issue_type,
        :priority,
        :project_id,
        :sprint_id,
        :assignee_id,
        :start_date,
        :end_date
      )

      project = Project.find_by(id: attrs[:project_id])
      return failure(:not_found, error: "Project not found") if project.nil?
      return failure(:forbidden, error: "Forbidden") unless @current_user.admin? || @current_user.projects.exists?(id: project.id)

      if attrs[:assignee_id].present? && !project.users.exists?(id: attrs[:assignee_id])
        return failure(:unprocessable_entity, error: "Assignee must be a member of this project")
      end



      sprint = Sprint.find_by(id: attrs[:sprint_id])

INSERT INTO "tickets" ("title", "description", "status", "issue_type", "priority", "start_date", "end_date", "project_id", "sprint_id", "assignee_id", "created_at", "updated_at", "attachment_urls") VALUES ('Ticket 10', 'Ticket 10', 0, 2, 1, '2026-05-18', '2026-05-22', 1, 1, 5, '2026-05-12 09:49:45.308298', '2026-05-12 09:49:45.308298', '[]') RETURNING "id"
---
      end

      ticket = Ticket.new(attrs)
      if ticket.save