backend/app/services/tickets/create_service.rb

    def call
      attrs = @params.permit(
        :title,
        :description,
        :status,
        :issue_type,
        :priority,
        :project_id,
        :sprint_id,
        :assignee_id,
        :start_date,
        :end_date
      )

      validated = PersistValidator.call_create(attrs: attrs)
      return validated unless validated[:ok]

      sprint = validated[:sprint]
      Rails.logger.info("sprint: #{sprint.to_json}")

      ticket = Ticket.new(attrs)
      if ticket.save
---
INSERT INTO "tickets" ("title", "description", "status", "issue_type", "priority", "start_date", "end_date", "project_id", "sprint_id", "assignee_id", "created_at", "updated_at", "attachment_urls") VALUES ('sa', 'dsad', 0, 2, 1, '2026-05-12', '2026-05-12', 6, 10, 2, '2026-05-13 11:57:21.705857', '2026-05-13 11:57:21.705857', '[]') RETURNING "id"