backend/app/services/tickets/update_service.rb

    def call
      ticket = Ticket.find_by(id: @ticket_id)
      return failure(:not_found, error: "Ticket not found") if ticket.nil?
      return failure(:forbidden, error: "Forbidden") unless @current_user.admin? || @current_user.projects.exists?(id: ticket.project_id)

      assignee_id = @permitted_attrs[:assignee_id]
      if assignee_id.present? && !ticket.project.users.exists?(id: assignee_id)
        return failure(:unprocessable_entity, error: "Assignee must be a member of this project")
      end

      Rails.logger.info("permitted_attrs: #{@permitted_attrs.to_json}")

      sprint_data = Sprint.find_by(id: @permitted_attrs[:sprint_id])
      if sprint_data.present? && sprint_data.end_date < Date.today
        return failure(:unprocessable_entity, error: "Sprint is already completed, so you cannot update tickets for it")
      end

      if sprint_data.present? && sprint_data.start_date > ticket.start_date && sprint_data.end_date < ticket.end_date
        return failure(:unprocessable_entity, error: "Start date must be after or equal to sprint start date and end date must be before or equal to sprint end date")
      end

      if ticket.update(@permitted_attrs)
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = 24 LIMIT 1
SELECT 1 AS one FROM "projects" INNER JOIN "project_users" ON "projects"."id" = "project_users"."project_id" WHERE "project_users"."user_id" = 8 AND "projects"."id" = 2 LIMIT 1
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = 4 LIMIT 1
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 2 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 12 LIMIT 1
SELECT 1 AS one FROM "users" INNER JOIN "project_users" ON "users"."id" = "project_users"."user_id" WHERE "project_users"."project_id" = 2 AND "users"."id" = 6 LIMIT 1
SELECT "sprints".* FROM "sprints" WHERE "sprints"."id" IS NULL LIMIT 1
SELECT "sprints".* FROM "sprints" WHERE "sprints"."id" = 3 LIMIT 1
UPDATE "tickets" SET "title" = 'Payment is not happening', "description" = 'check razorpay not working', "priority" = 2, "updated_at" = '2026-05-13 08:46:01.412435' WHERE "tickets"."id" = 29