backend/app/jobs/export_admin_summary_job.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 1 LIMIT 1
---
  def perform(user_id, board_params = {})
    board_params = {} unless board_params.is_a?(Hash)
    board_params = board_params.stringify_keys

    user = User.find_by(id: user_id)
    return unless user&.admin?

    Current.user = user
    result = Tickets::BoardQueryService.call(params: ActionController::Parameters.new(board_params))
    unless result[:ok]
      Rails.logger.warn(
        "[ExportAdminSummaryJob] Skipping export: user_id=#{user_id} params=#{board_params.inspect} " \
        "status=#{result[:status]} body=#{result[:body].inspect}"
      )
      return
    end

    relation = result[:relation]
    project = Project.find_by(id: board_params["project_id"].to_i)