backend/app/services/users/search_service.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = 1 LIMIT 1
SELECT "users"."id" FROM "users" INNER JOIN "project_users" ON "users"."id" = "project_users"."user_id" WHERE "project_users"."project_id" = 1
---
    def call
      validated = SearchValidator.call(params: @params)
      return validated unless validated[:ok]

      query = @params[:query]

      es_query =
        if query.present?
          {
            multi_match: {
              query: query,
              type: "bool_prefix",
              fields: [
                "name^2",
                "name._2gram",
                "name._3gram",
                "email",
                "email._2gram",
                "email._3gram"
              ]
            }
          }
        else
          { match_all: {} }
        end

      scoped_query =
        if @params[:project_id].present?
          project = Project.find_by(id: @params[:project_id])
          member_ids = project.users.ids.map(&:to_s)
          return { ok: true, users: [] } if member_ids.empty?