backend/app/services/admin_export_summary.rb

    def scope_lines(project, board_params)
      p = board_params.stringify_keys
      view = (p["board_view"].presence || "sprint").to_s
      lines = []
      lines << "Project: #{project&.name || "id=#{p['project_id']}"} (id=#{p['project_id']})"
      lines << "Board view: #{view}"

      case view
      when "sprint"
        sid = p["sprint_id"].to_i
        sp = sid.positive? ? Sprint.find_by(id: sid) : nil
---
SELECT "sprints".* FROM "sprints" WHERE "sprints"."id" = 1 LIMIT 1