backend/app/services/admin_export_summary.rb

  def self.build(project_id)
    parts = []
    parts << "Ticket system export"
    parts << "Generated at: #{Time.zone.now.iso8601}"
    parts << ""
    parts << "A CSV spreadsheet is attached: all projects, sprints, and tickets with statuses."
    parts << ""
    parts << "=== Tickets (summary) ==="
    parts << "project | sprint | ticket | status | priority | assignee | title"
    Ticket.includes(:project, :sprint, :assignee).where(project_id: project_id).find_each do |t|
      p = t.project
      s = t.sprint
      a = t.assignee
      parts << [
        p.name,
        s.name,
        "##{t.id}",
        t.status,
        t.priority,
        a.name,
        t.title.truncate(80)
      ].join(" | ")
    end
    parts << ""

    Project.includes(:sprints).where(id: project_id).find_each do |project|
      parts << "=== Project: #{project.name} (id=#{project.id}) ==="
      parts << "Description: #{project.description}"
      parts << ""

      counts = Ticket.where(project_id: project.id).group(:status).count
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" IN (1, 2)
SELECT "sprints".* FROM "sprints" WHERE "sprints"."id" IN (1, 2)
SELECT "tickets".* FROM "tickets" ORDER BY "tickets"."id" ASC LIMIT 1000
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 1
SELECT "sprints".* FROM "sprints" WHERE "sprints"."id" = 1
SELECT COUNT(*) AS "count_all", "tickets"."status" AS "tickets_status" FROM "tickets" WHERE "tickets"."project_id" = 1 GROUP BY "tickets"."status"

      parts << ""

      parts << "Sprints:"
      project.sprints.order(:id).each do |sp|
---
SELECT "sprints".* FROM "sprints" WHERE "sprints"."project_id" = 1 ORDER BY "sprints"."id" ASC

  def self.csv
    CSV.generate(headers: true, write_headers: true) do |csv|
      csv << %w[
        project_id
        project_name
        sprint_id
        sprint_name
        sprint_status
        sprint_start_date
        sprint_end_date
        ticket_id
        title
        ticket_status
        priority
        issue_type
        assignee_id
        assignee_name
        assignee_email
        ticket_start_date
        ticket_end_date
      ]

      Ticket.includes(:project, :sprint, :assignee).find_each do |t|
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" IN (1, 2)
SELECT "sprints".* FROM "sprints" WHERE "sprints"."id" IN (1, 2)
SELECT "tickets".* FROM "tickets" ORDER BY "tickets"."id" ASC LIMIT 1000