backend/app/controllers/application_controller.rb

  def current_user
    return @current_user if defined?(@current_user)

    user_id = request.headers["X-User-Id"].presence
    @current_user = user_id ? User.find_by(id: user_id) : nil
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1