backend/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def user_from_bearer_token
    auth = request.headers["Authorization"].to_s
    return nil unless auth.start_with?("Bearer ")

    token = auth.delete_prefix("Bearer ").strip
    payload = JsonWebToken.decode(token)
    return nil if payload.blank?

    uid = payload[:sub]
    User.find_by(id: uid) if uid.present?