backend/app/controllers/comments_controller.rb

  def index

    comments = @ticket.comments.includes(:user).order(:created_at)
---
SELECT "comments".* FROM "comments" WHERE "comments"."ticket_id" = 1 ORDER BY "comments"."created_at" ASC

  def create
    attrs = comment_params
    comment = @ticket.comments.build(
      user: current_user,
      message: attrs[:message],
      attachment_urls: attrs[:attachment_urls] || []
    )

    if comment.save
---
INSERT INTO "comments" ("ticket_id", "user_id", "message", "attachment_urls", "created_at", "updated_at") VALUES (2, 1, 'ioi', '["http://127.0.0.1:3000/attachments/disk/7ce2b138-17b1-40ec-887c-6b7277aef01d.png"]', '2026-05-13 11:38:38.834915', '2026-05-13 11:38:38.834915') RETURNING "id"

  def ticket_viewable?(ticket)
    current_user.admin? || current_user.projects.exists?(id: ticket.project_id)
---
SELECT 1 AS one FROM "projects" INNER JOIN "project_users" ON "projects"."id" = "project_users"."project_id" WHERE "project_users"."user_id" = 8 AND "projects"."id" = 2 LIMIT 1

  def set_ticket
    @ticket = Ticket.find_by(id: params.require(:ticket_id))
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = 1 LIMIT 1