backend/app/controllers/projects_controller.rb

    def index
        projects =
            if current_user.admin?
                Project.all
---
SELECT "projects".* FROM "projects"

    def create
        project = Project.new(project_params)
        if project.save
---
INSERT INTO "projects" ("name", "description", "created_at", "updated_at") VALUES ('Freshservice', 'Freshservice', '2026-05-12 09:15:59.355255', '2026-05-12 09:15:59.355255') RETURNING "id"

    def assign_users_to_project
        project = Project.find(params[:id])
        ids = Array(assign_users_params[:user_ids]).flatten.map(&:to_i).reject(&:zero?).uniq
        users = User.where(id: ids)
        if project.update(user_ids: users.pluck(:id))
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" IN (2, 3, 4, 5, 6)
SELECT "users"."id" FROM "users" WHERE "users"."id" IN (2, 6, 5, 4, 3)

    def show
        project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 1 LIMIT 1

    def update
        project = Project.find(params[:id])
        if project.update(name: params[:name], description: params[:description])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 1 LIMIT 1
UPDATE "projects" SET "name" = 'Fresh books', "updated_at" = '2026-05-13 11:35:06.690205' WHERE "projects"."id" = 5

    def destroy
        project = Project.find(params[:id])
        if project.destroy
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 3 LIMIT 1
DELETE FROM "projects" WHERE "projects"."id" = 3