backend/app/controllers/sprints_controller.rb

SELECT "sprints".* FROM "sprints" WHERE "sprints"."project_id" = 2
---
    def get_sprint_by_project_id
        sprints = Sprint.where(project_id: params[:project_id])