backend/app/controllers/users_controller.rb

  def index
    render json: User.all, status: :ok
---
SELECT "users".* FROM "users"

  def find_by_email
    user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'adminticketingsystem@yopmail.com' LIMIT 1

  def create
    user = build_user
    if user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "role", "created_at", "updated_at") VALUES ('Mounika', 'mounika@yopmail.com', '$2a$12$9KSJNBNIPEptrAntBsPTwejO96Bgr8WHpKqWLp0p.zlHIW/4daUVq', 0, '2026-05-12 15:37:34.886859', '2026-05-12 15:37:34.886859') RETURNING "id"

  def set_user
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IN (6, 4, 5, 2, 3)