backend/app/validators/tickets/board_query_validator.rb

    def call
      project_id = @params[:project_id].presence&.to_i
      if project_id.blank? || project_id <= 0
        return failure(:unprocessable_entity, error: "project_id is required")
      end

      unless Project.exists?(id: project_id)
        return failure(:not_found, error: "Project not found")
      end

      unless Current.user.admin? || Current.user.projects.exists?(id: project_id)
        return failure(:forbidden, error: "Forbidden")
      end

      board_view = (@params[:board_view].presence || "sprint").to_s
      sprint_id = nil

      case board_view
      when "sprint"
        sprint_id = @params[:sprint_id].presence&.to_i
        if sprint_id.blank? || sprint_id <= 0
          return failure(:unprocessable_entity, error: "sprint_id is required for sprint board_view")
        end
        unless Sprint.exists?(id: sprint_id, project_id: project_id)
---
SELECT "projects".* FROM "projects"
SELECT "projects".* FROM "projects" INNER JOIN "project_users" ON "projects"."id" = "project_users"."project_id" WHERE "project_users"."user_id" = 13
SELECT "users".* FROM "users" INNER JOIN "project_users" ON "users"."id" = "project_users"."user_id" WHERE "project_users"."project_id" = 6
SELECT 1 AS one FROM "projects" INNER JOIN "project_users" ON "projects"."id" = "project_users"."project_id" WHERE "project_users"."user_id" = 7 AND "projects"."id" = 6 LIMIT 1
SELECT "sprints".* FROM "sprints"
SELECT 1 AS one FROM "sprints" WHERE "sprints"."id" = 4 AND "sprints"."project_id" = 1 LIMIT 1