backend/app/validators/tickets/persist_validator.rb

    def validate_create(attrs)
      project = Project.find_by(id: attrs[:project_id])
      return failure(:not_found, error: "Project not found") if project.nil?
      unless Current.user.admin? || Current.user.projects.exists?(id: project.id)
        return failure(:forbidden, error: "Forbidden")
      end

      err = assignee_must_be_project_member_failure(project, attrs[:assignee_id])
      return err if err

      sprint = Sprint.find_by(id: attrs[:sprint_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 1 LIMIT 1
SELECT 1 AS one FROM "projects" INNER JOIN "project_users" ON "projects"."id" = "project_users"."project_id" WHERE "project_users"."user_id" = 12 AND "projects"."id" = 2 LIMIT 1
SELECT "sprints".* FROM "sprints" WHERE "sprints"."id" = 1 LIMIT 1

    def validate_update(ticket, permitted_attrs)
      return failure(:not_found, error: "Ticket not found") if ticket.nil?
      unless Current.user.admin? || Current.user.projects.exists?(id: ticket.project_id)
        return failure(:forbidden, error: "Forbidden")
      end

      err = assignee_must_be_project_member_failure(ticket.project, permitted_attrs[:assignee_id])
      return err if err

      sprint_data = Sprint.find_by(id: permitted_attrs[:sprint_id])
      if sprint_data.present? && sprint_data.end_date < Date.today
        return failure(
          :unprocessable_entity,
          error: "Sprint is already completed, so you cannot update tickets for it",
        )
      end

      if sprint_data.present? && sprint_data.start_date > ticket.start_date && sprint_data.end_date < ticket.end_date
---
SELECT 1 AS one FROM "projects" INNER JOIN "project_users" ON "projects"."id" = "project_users"."project_id" WHERE "project_users"."user_id" = 12 AND "projects"."id" = 2 LIMIT 1
SELECT "sprints".* FROM "sprints" WHERE "sprints"."id" = 1 LIMIT 1
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 1 LIMIT 1

    def assignee_must_be_project_member_failure(project, assignee_id)
      return nil if assignee_id.blank?
      return nil if project.users.exists?(id: assignee_id)
---
SELECT 1 AS one FROM "users" INNER JOIN "project_users" ON "users"."id" = "project_users"."user_id" WHERE "project_users"."project_id" = 1 AND "users"."id" = 2 LIMIT 1