backend/app/validators/sprints/close_validator.rb

SELECT "sprints".* FROM "sprints" WHERE "sprints"."id" = 9 LIMIT 1
SELECT 1 AS one FROM "projects" INNER JOIN "project_users" ON "projects"."id" = "project_users"."project_id" WHERE "project_users"."user_id" = 12 AND "projects"."id" = 2 LIMIT 1
SELECT "tickets".* FROM "tickets" WHERE "tickets"."sprint_id" = 12
SELECT 1 AS one FROM "tickets" WHERE "tickets"."sprint_id" = 9 LIMIT 1
---
    def call
      sprint = Sprint.find_by(id: @sprint_id)
      return failure(:not_found, error: "Sprint not found") if sprint.nil?
      unless Current.user.admin? || Current.user.projects.exists?(id: sprint.project_id)
        return failure(:forbidden, error: "Forbidden")
      end

      if sprint.tickets.any? && sprint.tickets.any? { |ticket| ticket.status != "done" }