backend/app/validators/sprints/create_validator.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = 6 LIMIT 1
SELECT 1 AS one FROM "projects" INNER JOIN "project_users" ON "projects"."id" = "project_users"."project_id" WHERE "project_users"."user_id" = 13 AND "projects"."id" = 8 LIMIT 1
---
    def call
      if @permitted[:start_date].to_date < Date.today
        return failure(:unprocessable_entity, error: "Start date must be in the future")
      end

      if @permitted[:end_date].to_date < Date.today
        return failure(:unprocessable_entity, error: "End date must be in the future")
      end

      project = Project.find_by(id: @permitted[:project_id])
      return failure(:not_found, error: "Project not found") if project.nil?
      unless Current.user.admin? || Current.user.projects.exists?(id: project.id)