backend/app/controllers/api/v1/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."ticket_id" = 4 ORDER BY "comments"."created_at" ASC
SELECT "users".* FROM "users" WHERE "users"."id" IN (2, 3, 5, 4, 6)
---
    def index
      comments = @ticket.comments.includes(:user).order(:created_at)

INSERT INTO "comments" ("ticket_id", "user_id", "message", "attachment_urls", "created_at", "updated_at") VALUES (4, 1, 'Can you please provide more details , regarding this page', '["http://127.0.0.1:3000/api/v1/attachments/disk/1338ca68-eabd-4af6-88ca-9ff8c45912f2.png"]', '2026-05-13 17:02:48.182632', '2026-05-13 17:02:48.182632') RETURNING "id"
---
    def create
      attrs = comment_params
      comment = @ticket.comments.build(
        user: current_user,
        message: attrs[:message],
        attachment_urls: attrs[:attachment_urls] || []
      )

      if comment.save

SELECT 1 AS one FROM "projects" INNER JOIN "project_users" ON "projects"."id" = "project_users"."project_id" WHERE "project_users"."user_id" = 7 AND "projects"."id" = 6 LIMIT 1
---
    def ticket_viewable?(ticket)
      current_user.admin? || current_user.projects.exists?(id: ticket.project_id)

SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = 4 LIMIT 1
---
    def set_ticket
      @ticket = Ticket.find_by(id: params.require(:ticket_id))