backend/app/controllers/api/v1/projects_controller.rb

        def index
            projects =
                if current_user.admin?
                    Project.all
---
SELECT "projects".* FROM "projects"

        def create
            project = Project.new(project_params)
            if project.save
---
INSERT INTO "projects" ("name", "description", "created_at", "updated_at") VALUES ('Amazon', 'Amazon', '2026-05-13 16:57:31.683840', '2026-05-13 16:57:31.683840') RETURNING "id"

        def assign_users_to_project
            project = Project.find(params[:id])
            ids = Array(assign_users_params[:user_ids]).flatten.map(&:to_i).reject(&:zero?).uniq
            users = User.where(id: ids)
            if project.update(user_ids: users.pluck(:id))
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 2 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" IN (5, 6, 8, 10)
SELECT "users"."id" FROM "users" WHERE "users"."id" IN (5, 6, 8, 10)

        def show
            project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 1 LIMIT 1

        def destroy
            project = Project.find(params[:id])
            if project.destroy
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 5 LIMIT 1
DELETE FROM "projects" WHERE "projects"."id" = 5