backend/app/controllers/api/v1/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'adminticketingsystem@yopmail.com' LIMIT 1
---
    def create
      email = session_params[:email].to_s.strip.downcase
      password = session_params[:password].to_s
      user = User.find_by(email: email)