backend/app/controllers/api/v1/sprints_controller.rb

      scope =
        if current_user.admin?
          Sprint.all
        else
          Sprint.where(project_id: current_user.projects.select(:id))
        end

      if params[:project_id].present?
        pid = params[:project_id].to_i
        unless current_user.admin? || current_user.projects.exists?(id: pid)
---
SELECT "sprints".* FROM "sprints"
SELECT 1 AS one FROM "sprints" WHERE "sprints"."id" = 1 AND "sprints"."project_id" = 1 LIMIT 1
SELECT "projects".* FROM "projects" INNER JOIN "project_users" ON "projects"."id" = "project_users"."project_id" WHERE "project_users"."user_id" = 15
SELECT "sprints".* FROM "sprints" WHERE "sprints"."project_id" = 1
SELECT 1 AS one FROM "projects" INNER JOIN "project_users" ON "projects"."id" = "project_users"."project_id" WHERE "project_users"."user_id" = 12 AND "projects"."id" = 2 LIMIT 1