backend/app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
      render json: User.all.map(&:for_api), status: :ok

INSERT INTO "users" ("name", "email", "password_digest", "role", "created_at", "updated_at") VALUES ('Test2', 'test2user@gmail.com', '$2a$12$Rdd1j5GJ1XjvHUqScxZ50erjEL.xy7LjJ8RAiij4W3yWGhx6hyuay', 0, '2026-05-13 15:56:37.782547', '2026-05-13 15:56:37.782547') RETURNING "id"
---
    def create
      user = build_user
      if user.save

SELECT "users".* FROM "users" WHERE "users"."id" IN (6, 5, 8)
---
    def set_user
      @user = User.find(params[:id])