backend/app/services/sprints/close_service.rb

        def call
            sprint = Sprint.find_by(id: @sprint_id)
            return failure(:not_found, error: "Sprint not found") if sprint.nil?
            return failure(:forbidden, error: "Forbidden") unless @current_user.admin? || @current_user.projects.exists?(id: sprint.project_id)

            #  check all the tickets in the sprint are done
            if sprint.tickets.any? && sprint.tickets.any? { |ticket| ticket.status != "done" }
                return failure(:unprocessable_entity, error: "Sprint is not completed because some tickets are not done")
            end

            sprint.update(status: :completed)
---
SELECT "sprints".* FROM "sprints" WHERE "sprints"."id" = 1 LIMIT 1
SELECT "tickets".* FROM "tickets" WHERE "tickets"."sprint_id" = 1
SELECT 1 AS one FROM "tickets" WHERE "tickets"."sprint_id" = 1 LIMIT 1
UPDATE "sprints" SET "status" = 2, "updated_at" = '2026-05-13 07:07:10.034496' WHERE "sprints"."id" = 5