backend/app/services/sprints/create_service.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = 2 LIMIT 1
INSERT INTO "sprints" ("name", "start_date", "end_date", "status", "project_id", "created_at", "updated_at") VALUES ('Sprint 3', '2026-05-13', '2026-05-13', 1, 2, '2026-05-13 07:06:05.764846', '2026-05-13 07:06:05.764846') RETURNING "id"
---
    def call
      permitted = @params.permit(:name, :start_date, :end_date, :project_id)
      if permitted[:start_date].to_date < Date.today
        return failure(:unprocessable_entity, error: "Start date must be in the future")
      end

      if permitted[:end_date].to_date < Date.today
        return failure(:unprocessable_entity, error: "End date must be in the future")
      end

      project = Project.find_by(id: permitted[:project_id])
      return failure(:not_found, error: "Project not found") if project.nil?
      return failure(:forbidden, error: "Forbidden") unless @current_user.admin? || @current_user.projects.exists?(id: project.id)

      sprint = Sprint.new(permitted)
      sprint.status = derived_status(sprint)

      if sprint.save